app/controllers/articles_controller.rb

  def create

      @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "cool"], ["content", "toptoptoptoptopttoptptotptopt"], ["user_id", 1], ["created_at", "2021-03-02 15:47:15.110537"], ["updated_at", "2021-03-02 15:47:15.110537"]]